emauriciorg/STM32/stm32f0/spi_fat32_esp/Src/sdio.c
uint8_t sd_card_init(void)
{

	uint8_t tryCntr=4;
  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_MASTER;
  hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_HIGH;
  hspi1.Init.CLKPhase = SPI_PHASE_2EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial = 10;



  if (HAL_SPI_Init(&hspi1) != HAL_OK)
  {
	  printf(" INIT spi error \r\n" );

  }



	uint8_t clock_counter;
	uint8_t init_sd_card_result = BSP_SD_OK;
	for (clock_counter = 0; clock_counter < 11; clock_counter++)
	{
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		SD_CS_HIGH();
	}

	do{
	 	tryCntr--;
	 	init_sd_card_result =  SD_GoIdleState();
	}while ((init_sd_card_result != BSP_SD_OK) && tryCntr );

	if (!tryCntr)
		SDIO_DEBUG("TRYOUT REACHED! \r\n");

	if (init_sd_card_result == BSP_SD_OK)
		SDIO_DEBUG("sdio SUCCESS\r\n");
	else
		SDIO_DEBUG("sdio ERROR %x \r\n", init_sd_card_result);

	return init_sd_card_result;
}

/**
  * @brief  Returns information about specific card.
  * @param  pCardInfo Pointer to a SD_CardInfo structure that contains all SD
  *         card information.
  * @retval The SD Response:
  *         - MSD_ERROR: Sequence failed
  *         - MSD_OK: Sequence succeed
  */


uint8_t BSP_SD_GetCardInfo(SD_CardInfo *pCardInfo)
{
  uint8_t status;

	status = SD_GetCSDRegister(&(pCardInfo->Csd));
	status|= SD_GetCIDRegister(&(pCardInfo->Cid));
	if(flag_SDHC == 1 )
	{
		pCardInfo->CardBlockSize = 512;
		pCardInfo->CardCapacity = (pCardInfo->Csd.version.v2.DeviceSize + 1) * pCardInfo->CardBlockSize;
	}
  else
  {

	pCardInfo->CardCapacity = (pCardInfo->Csd.version.v1.DeviceSize + 1) ;
	pCardInfo->CardCapacity *= (1 << (pCardInfo->Csd.version.v1.DeviceSizeMul + 2));
	pCardInfo->CardBlockSize = 1 << (pCardInfo->Csd.RdBlockLen);
	pCardInfo->CardCapacity *= pCardInfo->CardBlockSize;
  }

  return status;
}


 uint8_t  SD_read_block (uint32_t *block_to_read, uint32_t address_to_read ){

    if( BSP_SD_OK ==  BSP_SD_ReadBlocks(block_to_read, address_to_read  ,SD_BLOCK_SIZE, SD_SINGLE_BLOCK))
      return 1;
    else
      return 0;
 }

  uint8_t SD_write_block(uint32_t *block_to_write, uint32_t address_to_write ){

    if( BSP_SD_OK ==  BSP_SD_WriteBlocks(block_to_write, address_to_write  ,SD_BLOCK_SIZE, SD_SINGLE_BLOCK))
      return 1;
    else
      return 0;
 }
uint8_t BSP_SD_ReadBlocks(uint32_t* pData, uint32_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
	uint32_t offset = 0;
	uint8_t retr = BSP_SD_ERROR;
	uint8_t *ptr = NULL;
	SD_CmdAnswer_typedef response;

	/* Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
	Check if the SD acknowledged the set block length command: R1 response (0x00: no errors) */
	response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, SD_ANSWER_R1_EXPECTED);

	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if ( response.r1 != SD_R1_NO_ERROR)
	{
		SDIO_DEBUG("SD_CMD_SET_BLOCKLEN got response != SD_R1_NO_ERROR %x  \r\n",response.r1);

		goto error;
	}

	ptr = malloc(sizeof(uint8_t)*BlockSize);

	if ( ptr == NULL )
	{
		SDIO_DEBUG("can't alloc k \r\n");
		goto error;
	}

	memset(ptr, SD_DUMMY_BYTE, sizeof(uint8_t)*BlockSize);

  /* Data transfer */
	while (NumberOfBlocks--)
	{
		/* Send CMD17 (SD_CMD_READ_SINGLE_BLOCK) to read one block */
		/* Check if the SD acknowledged the read block command: R1 response (0x00: no errors) */
		response = SD_SendCmd(SD_CMD_READ_SINGLE_BLOCK, (ReadAddr + offset)/(flag_SDHC == 1 ?BlockSize: 1), 0xFF, SD_ANSWER_R1_EXPECTED);
		if ( response.r1 != SD_R1_NO_ERROR)
		{
			SDIO_DEBUG("CMD17 got response != SD_R1_NO_ERROR %x  \r\n",response.r1);
			goto error;
		}

		/* Now look for the data token to signify the start of the data */
		if (SD_WaitData(SD_TOKEN_START_DATA_SINGLE_BLOCK_READ) == BSP_SD_OK)
		{
			/* Read the SD block data : read NumByteToRead data */
			SD_IO_WriteReadData(ptr, (uint8_t*)pData + offset, BlockSize);

			/* Set next read address*/
			offset += BlockSize;
			/* get CRC bytes (not really needed by us, but required by SD) */
			SD_IO_WriteByte(SD_DUMMY_BYTE);
			SD_IO_WriteByte(SD_DUMMY_BYTE);
		}
		else
		{	SDIO_DEBUG("TOKEN got response != SD_R1_NO_ERROR %x  \r\n",response.r1);
			goto error;
		}

		/* End the command data read cycle */
		SD_IO_CSState(1);
		SD_IO_WriteByte(SD_DUMMY_BYTE);
}

	retr = BSP_SD_OK;

error :
	/* Send dummy byte: 8 Clock pulses of delay */
	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);
	if(ptr != NULL) free(ptr);

	/* Return the reponse */
	free (ptr);
	return retr;
}


uint8_t BSP_SD_WriteBlocks(uint32_t* pData, uint32_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
  uint32_t offset = 0;
  uint8_t retr = BSP_SD_ERROR;
  uint8_t *ptr = NULL;
  SD_CmdAnswer_typedef response;

  /* Send CMD16 (SD_CMD_SET_BLOCKLEN) to set the size of the block and
     Check if the SD acknowledged the set block length command: R1 response (0x00: no errors) */
  response = SD_SendCmd(SD_CMD_SET_BLOCKLEN, BlockSize, 0xFF, SD_ANSWER_R1_EXPECTED);
  SD_IO_CSState(1);
  SD_IO_WriteByte(SD_DUMMY_BYTE);
  if ( response.r1 != SD_R1_NO_ERROR){
    goto error;
  }

  ptr = malloc(sizeof(uint8_t)*BlockSize);
  if (ptr == NULL){
    goto error;
  }

  /* Data transfer */
  while (NumberOfBlocks--){
    /* Send CMD24 (SD_CMD_WRITE_SINGLE_BLOCK) to write blocks  and
       Check if the SD acknowledged the write block command: R1 response (0x00: no errors) */
    response = SD_SendCmd(SD_CMD_WRITE_SINGLE_BLOCK, (WriteAddr + offset)/(flag_SDHC == 1 ? BlockSize: 1), 0xFF, SD_ANSWER_R1_EXPECTED);
    if (response.r1 != SD_R1_NO_ERROR)
    {
      goto error;
    }

    /* Send dummy byte for NWR timing : one byte between CMDWRITE and TOKEN */
    SD_IO_WriteByte(SD_DUMMY_BYTE);
    SD_IO_WriteByte(SD_DUMMY_BYTE);

    /* Send the data token to signify the start of the data */
    SD_IO_WriteByte(SD_TOKEN_START_DATA_SINGLE_BLOCK_WRITE);

    /* Write the block data to SD */
    SD_IO_WriteReadData((uint8_t*)pData + offset, ptr, BlockSize);

    /* Set next write address */
    offset += BlockSize;

