emauriciorg/STM32/stm32f0/spi_fat32_esp/Src/sdio.c
	// if ((SD_R1_NO_ERROR) == (response & SD_R1_NO_ERROR) ) {
		// SDIO_DEBUG("\t\tSD_R1_NO_ERROR \r\n");
	// }

	if ((SD_R1_IN_IDLE_STATE) == (response & SD_R1_IN_IDLE_STATE) ) {
		SDIO_DEBUG("\t\t\tSD_R1_IN_IDLE_STATE \r\n");
	}

	if ((SD_R1_ERASE_RESET) == (response & SD_R1_ERASE_RESET) ) {
		SDIO_DEBUG("\t\t\tSD_R1_ERASE_RESET \r\n");
	}

	if ((SD_R1_ILLEGAL_COMMAND) == (response & SD_R1_ILLEGAL_COMMAND) ) {
		SDIO_DEBUG("\t\t\tSD_R1_ILLEGAL_COMMAND \r\n");
	}

	if ((SD_R1_COM_CRC_ERROR) == (response & SD_R1_COM_CRC_ERROR) ) {
		SDIO_DEBUG("\t\t\tSD_R1_COM_CRC_ERROR \r\n");
	}

	if ((SD_R1_ERASE_SEQUENCE_ERROR) == (response & SD_R1_ERASE_SEQUENCE_ERROR) ) {
		SDIO_DEBUG("\t\t\tSD_R1_ERASE_SEQUENCE_ERROR \r\n");
	}

	if ((SD_R1_ADDRESS_ERROR) == (response & SD_R1_ADDRESS_ERROR) ) {
		SDIO_DEBUG("\t\t\tSD_R1_ADDRESS_ERROR \r\n");
	}

	if ((SD_R1_PARAMETER_ERROR) == (response & SD_R1_PARAMETER_ERROR) ) {
		SDIO_DEBUG("\t\t\tSD_R1_PARAMETER_ERROR \r\n");
	}
}

void print_card_response(SD_CmdAnswer_typedef sd_response ){
	SDIO_DEBUG("R0 %x %x %x %x %x \r\n", sd_response.r1,
					sd_response.r2,
					sd_response.r3,
					sd_response.r4,
					sd_response.r5);
}

/**
  * @brief  Put the SD in Idle state.
  * @retval SD status
  */

uint8_t SD_GoIdleState(void)
{
	SD_CmdAnswer_typedef response;
	__IO uint8_t counter = 0;
	/*
	Send CMD0 (SD_CMD_GO_IDLE_STATE) to put SD in SPI mode and
	wait for In Idle State Response (R1 Format) equal to 0x01
	*/
	do{
	  counter++;
	  response = SD_SendCmd(SD_CMD_GO_IDLE_STATE, 0, 0x95, SD_ANSWER_R1_EXPECTED);

		SD_IO_CSState(1);
		SD_IO_WriteByte(SD_DUMMY_BYTE);
		sdio_response_parse(response.r1, SD_CMD_GO_IDLE_STATE);
		print_card_response (response);
		if(counter >= SD_MAX_TRY)
		{
			return BSP_SD_ERROR;
		}
	}while(response.r1 != SD_R1_IN_IDLE_STATE);


	/*
	Send CMD8 (SD_CMD_SEND_IF_COND) to check the power supply status
	and wait until response (R7 Format) equal to 0xAA and
	*/

	response = SD_SendCmd(SD_CMD_SEND_IF_COND, 0x1AA, 0x87, SD_ANSWER_R7_EXPECTED);
	SD_IO_CSState(1);
	SD_IO_WriteByte(SD_DUMMY_BYTE);

	sdio_response_parse(response.r1,SD_CMD_SEND_IF_COND);
	print_card_response (response);
	if((response.r1	& SD_R1_ILLEGAL_COMMAND) == SD_R1_ILLEGAL_COMMAND)
	{
		/* INITIALIZE CARD V1 */
		SDIO_DEBUG("CARD V1 Initialization----------------------------- \r\n" );
		do{
			/*
			Send CMD55 (SD_CMD_APP_CMD) before any ACMD command:
			R1 response (0x00: no errors)
			*/
			response = SD_SendCmd(SD_CMD_APP_CMD, 0x00000000, 0xFF, SD_ANSWER_R1_EXPECTED);

			SD_IO_CSState(1);

			SD_IO_WriteByte(SD_DUMMY_BYTE);
			print_card_response(response);
			/*
			Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize
			SDHC or SDXC cards: R1 response (0x00: no errors)
			*/
			response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x00000000, 0xFF, SD_ANSWER_R1_EXPECTED);
			SD_IO_CSState(1);
			SD_IO_WriteByte(SD_DUMMY_BYTE);
			print_card_response(response);

		}while(response.r1 == SD_R1_IN_IDLE_STATE);

		sdio_response_parse(response.r1, SD_CMD_SD_APP_OP_COND);

		flag_SDHC = 0;
	}
	else if(response.r1 == SD_R1_IN_IDLE_STATE)
	{
		SDIO_DEBUG("CARD V2 Initialization----------------------------- \r\n" );

		/* INITIALIZE CARD V2 */
		do {

			/*
			Send CMD55 (SD_CMD_APP_CMD) before any ACMD command:
			R1 response (0x00: no errors)
			*/
			response = SD_SendCmd(SD_CMD_APP_CMD, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
			SD_IO_CSState(1);
			SD_IO_WriteByte(SD_DUMMY_BYTE);
			print_card_response(response);




			/*
			Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC
			or SDXC cards: R1 response (0x00: no errors)
			*/
			response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x40000000, 0xFF, SD_ANSWER_R1_EXPECTED);
			SD_IO_CSState(1);
			SD_IO_WriteByte(SD_DUMMY_BYTE);

			sdio_response_parse(response.r1, SD_CMD_SD_APP_OP_COND);
			print_card_response(response);

		}while(response.r1 == SD_R1_IN_IDLE_STATE);

		sdio_response_parse(response.r1, SD_CMD_APP_CMD);

		if((response.r1 & SD_R1_ILLEGAL_COMMAND) == SD_R1_ILLEGAL_COMMAND)
		{
			SDIO_DEBUG("SD_R1_ILLEGAL_COMMAND -----------------------------\r\n" );
			do {
				/*
				Send CMD55 (SD_CMD_APP_CMD) before any ACMD
				command: R1 response (0x00: no errors)
				*/

				response = SD_SendCmd(SD_CMD_APP_CMD, 0, 0xFF, SD_ANSWER_R1_EXPECTED);
				SD_IO_CSState(1);
				SD_IO_WriteByte(SD_DUMMY_BYTE);
				print_card_response(response);



				if(response.r1 != SD_R1_IN_IDLE_STATE)
				{
					SDIO_DEBUG("CMD55 Error \r\n");
					return BSP_SD_ERROR;
				}
			/*
			Send ACMD41 (SD_CMD_SD_APP_OP_COND) to initialize SDHC
			or SDXC cards: R1 response (0x00: no errors)
			*/
				response = SD_SendCmd(SD_CMD_SD_APP_OP_COND, 0x0, 0xFF, SD_ANSWER_R1_EXPECTED);
				SD_IO_CSState(1);
				SD_IO_WriteByte(SD_DUMMY_BYTE);
				print_card_response(response);

			}while(response.r1 == SD_R1_IN_IDLE_STATE);

			sdio_response_parse(response.r1, SD_CMD_APP_CMD);
		}

		/*
		Send CMD58 (SD_CMD_READ_OCR) to initialize SDHC or SDXC
		cards: R3 response (0x00: no errors)
		*/

		response = SD_SendCmd(SD_CMD_READ_OCR, 0x00000000, 0xFF, SD_ANSWER_R3_EXPECTED);
		SD_IO_CSState(1);
		SD_IO_WriteByte(SD_DUMMY_BYTE);

		print_card_response(response);
		sdio_response_parse(response.r1, SD_CMD_READ_OCR);

		if(response.r1 != SD_R1_NO_ERROR)
		{
			return BSP_SD_ERROR;
		}

		flag_SDHC = (response.r2 & 0x40) >> 6;
	}
	else
	{
		return BSP_SD_ERROR;
	}

	return BSP_SD_OK;
}

/**
  * @brief  Waits a data until a value different from SD_DUMMY_BITE
  * @retval the read value
  */
uint8_t SD_ReadData(void)
{
  uint8_t timeout = 0x08;
  uint8_t readvalue;

  /* Check if response is got or a timeout is happen */
  do {
    readvalue = SD_IO_WriteByte(SD_DUMMY_BYTE);
    timeout--;

  }while ((readvalue == SD_DUMMY_BYTE) && timeout);

  /* Right response got */
  return readvalue;
}

/**
  * @brief  Waits a data from the SD card
  * @param  data  Expected data from the SD card
  * @retval BSP_SD_OK or BSP_SD_TIMEOUT
  */
uint8_t SD_WaitData(uint8_t data)
{
  uint16_t timeout = 0xFFFF;
  uint8_t readvalue;

  /* Check if response is got or a timeout is happen */

  do {
    readvalue = SD_IO_WriteByte(SD_DUMMY_BYTE);
    timeout--;
  }while ((readvalue != data) && timeout);

  if (timeout == 0)
  {
    /* After time out */
    return BSP_SD_TIMEOUT;
  }

  /* Right response got */
  return BSP_SD_OK;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
